Public Attributes | List of all members
API_3D_Head Struct Reference
ModelAccess API
Common header for the 3D components. More...
#include <APIdefs_3D.h>
 Public Attributes
 API_3DTypeID  | typeID
Identifies the type of the component.
 Int32  | index
The index field gives the current database index of the given component. Note that this number is not constant for a particular element through the whole life of the project element index.
 Int32  | elemIndex
Gives the internal element index plus one for a body; output only parameter for API_BodyType. It can be used to get the (u,v) texture coordinates with ACAPI_ModelAccess_GetTextureCoord.
 Int32  | bodyIndex
Gives the internal body index plus one for a body; output only parameter for API_BodyType. It can be used to get the (u,v) texture coordinates with ACAPI_ModelAccess_GetTextureCoord.
Detailed Description
Common header for the 3D components.
Remarks
This structure specify the type and the database index of a 3D component. You can get a 3D component by the ACAPI_ModelAccess_GetComponent function. Give the type and index information in the appropriate fields of the header of an API_Component3D structure, and you will get its other parameters.
Example
Several uses of this an other 3D-related structures can be found in the 3D_Test
sample project.